import {
  DeviceArrowIcon,
  DeviceCardsIcon,
  DeviceClockIcon,
  DeviceListIcon,
  DeviceLockIcon,
  DeviceChartIcon,
} from "@/components/StockLogos";

export const navData = [
  { _id: 101, title: "الصفحة الرئيسية", href: "#home" },
  { _id: 102, title: "المميزات", href: "#features" },
  { _id: 103, title: "فتح حساب", href: "#account" },
  { _id: 104, title: "التقييمات", href: "#reviews" },
];

export const accountData = [
  {
    name: "استثمر أي مبلغ",
    description:
      "سواء كان المبلغ 1 دولار أو 1,000,000 دولار، يمكننا أن نضع أموالك في العمل من أجلك.",
    icon: DeviceArrowIcon,
  },
  {
    name: "بناء ملف تعريف متوازن",
    description:
      "استثمر في الصناعات المختلفة لتجد أكبر عدد من الفرص لتحقيق مكاسب ضخمة.",
    icon: DeviceCardsIcon,
  },
  {
    name: "التجارة في الوقت الحقيقي",
    description:
      "احصل على نصائح داخلية حول تحركات الأسهم الكبيرة وقم بالتصرف بناءً عليها في غضون ثوانٍ.",
    icon: DeviceClockIcon,
  },
  {
    name: "الربح من شبكتك",
    description:
      "قم بدعوة المطلعين الجدد للحصول على النصائح بشكل أسرع والتغلب على مستخدمي منصة استثمر الان الآخرين.",
    icon: DeviceListIcon,
  },
  {
    name: "مشفرة ومجهولة المصدر",
    description:
      "تكنولوجيا الأمان المتطورة التي لا تعرفها حتى وكالة الأمن القومي تبقيك مخفيًا.",
    icon: DeviceLockIcon,
  },
  {
    name: "تتبع التقدم",
    description:
      "شاهد استثماراتك تنمو بشكل كبير، تاركًا المستثمرين الآخرين في الغبار.",
    icon: DeviceChartIcon,
  },
];

export const reviews = [
  {
    title: "إنه يعمل حقًا.",
    body: "لقد قمت بتنزيل منصة أسهم اليوم وحولت مبلغ 5000 دولار إلى 25000 دولار في نصف ساعة.",
    author: "مستثمر",
    rating: 5,
  },
  {
    title: "أنتم تحتاجون لهذا التطبيق",
    body: "لم أفهم سوق الأوراق المالية على الإطلاق قبل منصة أسهم. ما زلت لا أفعل ذلك، ولكن على الأقل أنا غني الآن.",
    author: "CluelessButRich",
    rating: 5,
  },
  {
    title: "هذا لا ينبغي أن يكون قانونيًا.",
    body: "إن منصة أسهم تجعل الفوز الكبير في سوق الأسهم أمرًا سهلاً للغاية حتى لا أستطيع أن أصدق أنها قانونية فعلاً.",
    author: "LivingDaDream",
    rating: 4,
  },
  {
    title: "لقد خدعونا المستشارون الماليون.",
    body: "لم أحقق أي أرباح تذكر من استثماراتي في الصناديق المشتركة. مع منصة أسهم، أقوم بمضاعفة قيمتي الصافية كل شهر.",
    author: "JordanBelfort1962",
    rating: 5,
  },
  {
    title: "أنا أحبها!",
    body: "بدأت في تزويد المعلومات الداخلية بنفسي والآن أحصل على نصائح داخلية جديدة كل 5 دقائق. ليس لدي حتى وقت للتصرف في كل هذه النصائح. سيتم توصيل سيارة لامبورغيني الجديدة الأسبوع المقبل!",
    author: "MrBurns",
    rating: 3,
  },
  {
    title: "أمر جيد للغاية ليكون حقيقة.",
    body: "كنت أربح المال بسرعة كبيرة مع منصة أسهم بحيث يبدو وكأنه احتيال. ولكن قمت ببيع حصصي وسحب المال وهو حقيقي في حسابي المصرفي. هذا التطبيق مذهل!",
    author: "LazyRich99",
    rating: 2,
  },
  {
    title: "أتمنى لو أستطيع أن أقدم 6 نجوم",
    body: "هذا هو حقًا التطبيق الأكثر أهمية ستقوم بتنزيله في حياتك. ابدأ في استخدامه قبل أن يصبح شائعًا لدرجة أن الجميع الآخر يحصلون على هذه النصائح أيضًا.",
    author: "SarahLuvzCash",
    rating: 5,
  },
  {
    title: "اشتريت جزيرة.",
    body: "نعم، قرأت ذلك بشكل صحيح. هل تريد جزيرتك الخاصة أيضًا؟ احصل على منصة أسهم.",
    author: "ScroogeMcduck",
    rating: 5,
  },
  {
    title: "لا ديون بعد الآن!",
    body: "بعد أسبوعين من التداول على منصة أسهم، أصبحت خالية من الديون. لماذا ذهبت إلى المدرسة على الإطلاق عندما يوجد منصة أسهم؟",
    author: "BruceWayne",
    rating: 1,
  },
  {
    title: "أنا عمري 19 عامًا وأنا غني.",
    body: "أحب أنه باستخدام منصة أسهم وتعتيم المعاملات، يمكنني التسجيل وبدء التداول عندما كنت في الـ 12 من عمري. كان لدي مليون دولار قبل أن تنمو شعرة في إبطي!",
    author: "RichieRich",
    rating: 5,
  },
  {
    title: "بدأت شركة استثمارية.",
    body: "أقوم بتحصيل رسوم إدارة بنسبة 3٪ من العملاء وأقوم بإدخال كل استثماراتهم في منصة أسهم. أموال سهلة!",
    author: "TheCountOfMonteChristo",
    rating: 5,
  },
  {
    title: "إنها مثل قوة خارقة.",
    body: "كل نصيحة يرسلها منصة أسهم لي تكون مربحة. إنها مثل لعبة البلاكجاك ولكن مع معرفة البطاقة التالية تحديدًا!",
    author: "ClarkKent",
    rating: 4,
  },
  {
    title: "قمت بترك وظيفتي.",
    body: "حملت منصة أسهم قبل ثلاثة أيام وتركت وظيفتي اليوم. لا أستطيع أن أصدق أنه لم يخطر في بال أحد آخر ببناء تطبيق لتداول الأسهم بهذه الطريقة!",
    author: "GeorgeCostanza",
    rating: 5,
  },
  {
    title: "لا تقم بتنزيل هذا التطبيق",
    body: "ما لم ترغب في أن تمتلك أفضل حياة على الإطلاق! أنا حقًا أكتب هذا من على يخت.",
    author: "JeffBezos",
    rating: 3,
  },
];
